app/controllers/categories_controller.rb

SELECT * FROM `categories` ORDER BY position
SELECT * FROM `categories` WHERE (`categories`.`enabled` = 1) ORDER BY position
SELECT `items`.* FROM `items` INNER JOIN `categories` ON `categories`.id = `items`.category_id WHERE (`categories`.`user_id` IS NULL) AND (`items`.`enabled` = 1) ORDER BY photo_updated_at DESC LIMIT 17
---
  def index
    if can? :update, Category
      if params.has_key? "user_id"
        @categories = Category.find_all_by_user_id(params[:user_id].to_i, :order => 'position')
      else
        @categories = Category.all(:order => 'position')
      end
    else
      @categories = Category.find_all_by_enabled(1, :order => 'position')
    end
    @new_items = Item.find_all_by_enabled(1, :joins => :category, :conditions => {:categories => {:user_id => nil}},
                                           :order => "photo_updated_at DESC", :limit => 17)

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
SELECT * FROM `categories` WHERE (`categories`.`enabled` = 1 AND `categories`.`id` = '1') LIMIT 1
---
  def show
    if can? :update, Category
      @category = Category.find(params[:id])
    else
      @category = Category.find_by_id_and_enabled(params[:id], 1)

INSERT INTO `categories` (`name`, `position`, `created_at`, `updated_at`, `enabled`, `user_id`) VALUES('Yarn', NULL, '2011-11-06 18:05:07', '2011-11-06 18:05:07', 0, NULL)
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT * FROM `categories` WHERE (`categories`.`id` = 4)
DELETE FROM `categories` WHERE `id` = 4
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy

UPDATE `categories` SET position=1 WHERE (id='2')
---
  def sort
    params[:categories].each_with_index do |id, index|
      Category.update_all(['position=?', index+1], ['id=?', id])

UPDATE `categories` SET `enabled` = 1, `updated_at` = '2011-11-06 22:45:29' WHERE `id` = 1
---
  def enable
    @category_id = params[:id]
    Category.update(@category_id, :enabled => 1)

UPDATE `categories` SET `enabled` = 0, `updated_at` = '2011-11-06 22:45:43' WHERE `id` = 1
---
  def disable
    @category_id = params[:id]
    Category.update(@category_id, :enabled => 0)