app/controllers/items_controller.rb

SELECT * FROM `items` WHERE (`items`.`id` = 5)
SELECT * FROM `items` WHERE (`items`.`enabled` = 1 AND `items`.`id` = '4') LIMIT 1
---
  def show
    if can? :update, Item
      @item = Item.find(params[:id])
    else
      @item = Item.find_by_id_and_enabled(params[:id], 1)

INSERT INTO `items` (`name`, `price`, `position`, `created_at`, `photo_file_size`, `updated_at`, `photo_file_name`, `photo_content_type`, `enabled`, `category_id`, `photo_updated_at`, `description`) VALUES('Pink Yarn', NULL, 1, '2011-11-06 18:05:58', 2695403, '2011-11-06 18:05:58', 'IMG_1516.JPG', 'image/jpeg', 0, 1, '2011-11-06 18:05:55', 'This is pink yarn that is fluffy.')
---
  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save

SELECT * FROM `items` WHERE (`items`.`id` = 5)
UPDATE `items` SET `updated_at` = '2012-01-01 04:47:56', `photo_updated_at` = '2012-01-01 04:47:53', `description` = 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Donec elementum nunc sit amet justo facilisis euismod. Nulla nec sem at tellus posuere ullamcorper. Quisque sit amet lectus tempus ipsum ornare tristique. Praesent fermentum tristique ipsum non bibendum. Suspendisse tristique nibh fringilla tortor ornare iaculis. Ut consectetur lobortis euismod. Praesent aliquet erat vitae quam malesuada sit amet tincidunt massa cursus. Pellentesque at enim eu odio vulputate accumsan non eget ante. Suspendisse potenti. Nulla pellentesque leo in risus fringilla laoreet. Pellentesque rhoncus, arcu sed cursus suscipit, arcu leo tincidunt felis, et facilisis metus magna vitae justo. Aenean eu nisi non neque consectetur semper ac feugiat est. Ut ut venenatis tellus. Phasellus vehicula felis tincidunt orci luctus in varius felis convallis. ' WHERE `id` = 1
---
  def update
    @item = Item.find(params[:id])

    respond_to do |format|
      if @item.update_attributes(params[:item])

UPDATE `items` SET position=1 WHERE (id='1')
---
  def sort
    if params.keys.grep(/^category_(\d*)_items$/)[0] != nil
        params[params.keys.grep(/^category_(\d*)_items$/)[0]].each_with_index do |id, index|
          Item.update_all(['position=?', index+1], ['id=?', id])

UPDATE `items` SET `enabled` = 1, `updated_at` = '2011-11-06 23:22:00' WHERE `id` = 3
---
  def enable
    @item_id = params[:id]
    Item.update(@item_id, :enabled => 1)

UPDATE `items` SET `enabled` = 0, `updated_at` = '2011-11-06 23:22:02' WHERE `id` = 3
---
  def disable
    @item_id = params[:id]
    Item.update(@item_id, :enabled => 0)