app/controllers/options_controller.rb

  def create
    @option = Option.new(params[:option])

    respond_to do |format|
      if @option.save
---
INSERT INTO `options` (`price`, `position`, `created_at`, `details`, `quantity`, `updated_at`, `enabled`, `item_id`) VALUES(100, 1, '2012-01-09 07:57:18', '10x60 inch purple scarf', 100, '2012-01-09 07:57:18', 0, 5)

  def enable
    @option_id = params[:id]
    Option.update(@option_id, :enabled => 1)
---
UPDATE `options` SET `enabled` = 1, `updated_at` = '2012-01-09 07:57:25' WHERE `id` = 1