app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `roles_mask`, `email`) VALUES('2011-11-06 06:24:11', '27b56d27187fdc9dd3a8c6fc17c6085be936585bfef6da3a180077bab7447f2fdc1acda4fd98bdd68fcc4ba0230fd7b7b2fe89afd57963f2224f3b779501a20c', '2011-11-06 06:24:11', 'cwpeter', 'EfU3LJjnCbPILZKfNLYQ', '95d36b5c7774b5a4e1c1845c594a439d09a84f1c8cfd20d6f09470228e608b16faf64226e3e192a73bad908acf1125583b69639ef42a6ad5a9f8a239393991f0', 0, 'chrisp1982@yahoo.com')